In [1]:
import pandas as pd
import numpy as np

######  Pandas is a data Analytics tools used for data manipulation , analytics and managemnet

In Pandas we have 2 types of data sturctures

1. Series 

2. DataFrame

###  Series Data Structure

###### It is a one dimensional data

In [2]:
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

###  Working with index

We Will be having only row Index in series DS
By default index will be position of elements. But we can give our own index

In [3]:
arr = pd.Series([1,2,3,4], index = ["D1","D2","D3","D4"])
arr

D1    1
D2    2
D3    3
D4    4
dtype: int64

In [4]:
arr.index # Gives the index

Index(['D1', 'D2', 'D3', 'D4'], dtype='object')

After Creating the series also we can change the index

In [5]:
arr2 = pd.Series([1,2,3,4])
arr2.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
arr2.index = ['D1', 'D2', 'D3', 'D4']  # Changing the index
arr2

D1    1
D2    2
D3    3
D4    4
dtype: int64

## Data Frame

######  Multidimensional Data
###### Tabular Structure(With rows and Columns)

In [7]:
df = pd.DataFrame() # Empty DataFrame

In [8]:
df

Empty DataFrame
Columns: []
Index: []

In [9]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [10]:
df = pd.DataFrame([["Manu",23,"Kalamboor"],["Manas",20,"Mulamthuruthy"],["Platty",24,"Arayankavu"]])

In [11]:
df

        0   1              2
0    Manu  23      Kalamboor
1   Manas  20  Mulamthuruthy
2  Platty  24     Arayankavu

###### Giving Row Index

In [12]:
df1 = pd.DataFrame([["Manu",23,"Kalamboor"],["Manas",20,"Mulamthuruthy"],["Platty",24,"Arayankavu"]],index=["D1","D2","D3"])

In [13]:
df1

         0   1              2
D1    Manu  23      Kalamboor
D2   Manas  20  Mulamthuruthy
D3  Platty  24     Arayankavu

###### Giving Column Index

In [14]:
df2 = pd.DataFrame([["Manu",23,"Kalamboor"],["Manas",20,"Mulamthuruthy"],["Platty",24,"Arayankavu"]],
                   index=["D1","D2","D3"],columns=["Name","Age","City"])
df2

      Name  Age           City
D1    Manu   23      Kalamboor
D2   Manas   20  Mulamthuruthy
D3  Platty   24     Arayankavu

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df4 = pd.DataFrame([["Manu",23,],["Manas",34,"Mulamthuruthy"],["Platty",24,"Arayankavu"]],
                   index=["D1","D2","D3"],columns=["Name","Age","City"])
df4

      Name  Age           City
D1    Manu   23           None
D2   Manas   34  Mulamthuruthy
D3  Platty   24     Arayankavu

Missing values will be replaced with None

#### Data Frame From Dictonary

######  Here keys - > Column Name
###### List of values  - > Actual Values

In [17]:
df5 = pd.DataFrame({"Name" : ["Manu","Manas","Platty"],
                    "Age" : [23,26,34],
                    "City" : ["Kalamboor","Mulamthuruthy","Arayankavu"]
                   })
df5

     Name  Age           City
0    Manu   23      Kalamboor
1   Manas   26  Mulamthuruthy
2  Platty   34     Arayankavu

### Manipulation With Series

What happens when we use Multi dimesnional data to create series

In [18]:
s3  = pd.Series([["Manu",23,],["Manas",34,"Mulamthuruthy"],["Platty",24,"Arayankavu"]],
                   index=["D1","D2","D3"]) 
s3

D1                    [Manu, 23]
D2    [Manas, 34, Mulamthuruthy]
D3      [Platty, 24, Arayankavu]
dtype: object

D1  [Manu, 23] -> Treated as one single element
D2  [Manas, 34, Mulamthuruthy] -> one single element

In [19]:
s3[0]

['Manu', 23]

### Slicing with series

In [20]:
s4 = pd.Series([1,2,3,4],index=["D1","D2","D3","D4"])
s4

D1    1
D2    2
D3    3
D4    4
dtype: int64

In [21]:
s4.shape

(4,)

In [22]:
s4.size # Number of elements

4

In [23]:
s4.dtype

dtype('int64')

In [24]:
s4[0] #Using the index

1

In [25]:
s4["D2"] # Using name of the index

2

In [26]:
s4["D1":"D3"] # Upper limited is included

D1    1
D2    2
D3    3
dtype: int64

In [27]:
s4[0:3]

D1    1
D2    2
D3    3
dtype: int64

In [28]:
s4["D1":]

D1    1
D2    2
D3    3
D4    4
dtype: int64

In [29]:
s4[[0,3]]

D1    1
D4    4
dtype: int64

In [30]:
s4[["D1","D4"]] # For getting specific elements D1 and D4

D1    1
D4    4
dtype: int64

In [31]:
s4["D1":"D4"] # Return ELEMENTS from D1 to D4

D1    1
D2    2
D3    3
D4    4
dtype: int64

### DataFrame Slicing

In [32]:
df5 = pd.DataFrame([["Manu",23],["Manas",34,"Mulamthuruthy"],["Platty",24,"Arayankavu"]],
                   index=["D1","D2","D3"],columns=["Name","Age","City"])
df5

      Name  Age           City
D1    Manu   23           None
D2   Manas   34  Mulamthuruthy
D3  Platty   24     Arayankavu

In [33]:
df5.shape

(3, 3)

In [34]:
df5.size

9

In [35]:
df5.dtypes # Returns Data type of each column

Name    object
Age      int64
City    object
dtype: object

In pandas Object is Either group of data types or String

In [36]:
df5.info() # Gives complete information about the data frame

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, D1 to D3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    2 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

### Working With CSV (Comma Seperated Values)

####  Reading CSV File

In [37]:
data = pd.read_csv(r"Data.csv")
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [38]:
data.shape

(10, 4)

In [39]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [40]:
data["Country"]

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

data["Country"] The ouput will be in sereis format

In [41]:
data[["Age"]] # DataFrame Format

    Age
0  44.0
1  27.0
2  30.0
3  38.0
4  40.0
5  35.0
6   NaN
7  48.0
8  50.0
9  37.0

####  Slice Multiple Columns

In [42]:
data[["Age","Country"]] #Listing specific column name in DF Fromat

    Age  Country
0  44.0   France
1  27.0    Spain
2  30.0  Germany
3  38.0    Spain
4  40.0  Germany
5  35.0   France
6   NaN    Spain
7  48.0   France
8  50.0  Germany
9  37.0   France

In [43]:
data[["Salary","Age","Country"]]

    Salary   Age  Country
0  72000.0  44.0   France
1  48000.0  27.0    Spain
2  54000.0  30.0  Germany
3  61000.0  38.0    Spain
4      NaN  40.0  Germany
5  58000.0  35.0   France
6  52000.0   NaN    Spain
7  79000.0  48.0   France
8  83000.0  50.0  Germany
9  67000.0  37.0   France

In [44]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

######  iloc

In [45]:
data.iloc[:,0]    # Slicing based on index of rows and columns
                  # data.iloc[row,column]

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [46]:
data.iloc[:,0:2]

   Country   Age
0   France  44.0
1    Spain  27.0
2  Germany  30.0
3    Spain  38.0
4  Germany  40.0
5   France  35.0
6    Spain   NaN
7   France  48.0
8  Germany  50.0
9   France  37.0

In [47]:
data.iloc[2:6,1:4]

    Age   Salary Purchased
2  30.0  54000.0        No
3  38.0  61000.0        No
4  40.0      NaN       Yes
5  35.0  58000.0       Yes

In [48]:
data.iloc[8:,2:]

    Salary Purchased
8  83000.0        No
9  67000.0       Yes

###### loc -> In loc complusory we have to use the names of the index( Column name and row names). If the column names are numbers then we can use numbers

In [49]:
data.loc[:,"Country":"Salary"]  # Using Column names and row names

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [50]:
data.loc[0:3,"Country":"Salary"]

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0

In [51]:
data.loc[6:8,"Country":"Salary"]

   Country   Age   Salary
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0

#### Identifying the NaN values (Missing Values)

In [52]:
data.isnull()  # In place of missing value is shows True

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [53]:
data.isnull().any() # Shows at which column we have a missing value

Country      False
Age           True
Salary        True
Purchased    False
dtype: bool

In [54]:
data["Country"].isnull().any()

False

In [55]:
data["Age"].isnull() # Shows True In Place of missinf value

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: Age, dtype: bool

In [56]:
data.isnull().sum() # Gives the number of missing values in Each Column

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

### To Add a row to the dataset

In [57]:
data.append({
    "Country":"Germany",
    "Age":40,
    "Salary":15000,
    "Purchased":"No"
},ignore_index=True) 
# DataFrame won't be updated automatically we need to assign to to data

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain  27.0  48000.0       Yes
2   Germany  30.0  54000.0        No
3     Spain  38.0  61000.0        No
4   Germany  40.0      NaN       Yes
5    France  35.0  58000.0       Yes
6     Spain   NaN  52000.0        No
7    France  48.0  79000.0       Yes
8   Germany  50.0  83000.0        No
9    France  37.0  67000.0       Yes
10  Germany  40.0  15000.0        No

In [58]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [59]:
data = data.append({
    "Country":"Germany",
    "Age":40,
    "Salary":15000,
    "Purchased":"No"
},ignore_index=True)

In [60]:
data

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain  27.0  48000.0       Yes
2   Germany  30.0  54000.0        No
3     Spain  38.0  61000.0        No
4   Germany  40.0      NaN       Yes
5    France  35.0  58000.0       Yes
6     Spain   NaN  52000.0        No
7    France  48.0  79000.0       Yes
8   Germany  50.0  83000.0        No
9    France  37.0  67000.0       Yes
10  Germany  40.0  15000.0        No

#### Inserting a Column

In [61]:
np.arange(9847669313,9847669324) # Generating 11 mobile numbers

array([9847669313, 9847669314, 9847669315, 9847669316, 9847669317,
       9847669318, 9847669319, 9847669320, 9847669321, 9847669322,
       9847669323], dtype=int64)

In [62]:
data["Mobile"] = np.arange(9847669313,9847669324) # Creating a new column and assigning values to it

In [63]:
data

    Country   Age   Salary Purchased      Mobile
0    France  44.0  72000.0        No  9847669313
1     Spain  27.0  48000.0       Yes  9847669314
2   Germany  30.0  54000.0        No  9847669315
3     Spain  38.0  61000.0        No  9847669316
4   Germany  40.0      NaN       Yes  9847669317
5    France  35.0  58000.0       Yes  9847669318
6     Spain   NaN  52000.0        No  9847669319
7    France  48.0  79000.0       Yes  9847669320
8   Germany  50.0  83000.0        No  9847669321
9    France  37.0  67000.0       Yes  9847669322
10  Germany  40.0  15000.0        No  9847669323

In [64]:
data.columns # List the column names

Index(['Country', 'Age', 'Salary', 'Purchased', 'Mobile'], dtype='object')

In [65]:
data.index  # Get the indexes

RangeIndex(start=0, stop=11, step=1)

### Boolean Indexing

In [66]:
data["Country"] == "France"  # Gives True for in place of France in country column

0      True
1     False
2     False
3     False
4     False
5      True
6     False
7      True
8     False
9      True
10    False
Name: Country, dtype: bool

In [67]:
data[data["Country"]=="France"] # Gives the full details for which the Country is france

  Country   Age   Salary Purchased      Mobile
0  France  44.0  72000.0        No  9847669313
5  France  35.0  58000.0       Yes  9847669318
7  France  48.0  79000.0       Yes  9847669320
9  France  37.0  67000.0       Yes  9847669322

In [68]:
data[ (data["Country"]=="France") | (data["Country"]=="Germany") ]

    Country   Age   Salary Purchased      Mobile
0    France  44.0  72000.0        No  9847669313
2   Germany  30.0  54000.0        No  9847669315
4   Germany  40.0      NaN       Yes  9847669317
5    France  35.0  58000.0       Yes  9847669318
7    France  48.0  79000.0       Yes  9847669320
8   Germany  50.0  83000.0        No  9847669321
9    France  37.0  67000.0       Yes  9847669322
10  Germany  40.0  15000.0        No  9847669323

In [69]:
data[ (data["Country"]=="France") & (data["Purchased"]=="Yes") ] #France Customers who purchased the product

  Country   Age   Salary Purchased      Mobile
5  France  35.0  58000.0       Yes  9847669318
7  France  48.0  79000.0       Yes  9847669320
9  France  37.0  67000.0       Yes  9847669322

In [70]:
data[ (data["Country"]=="Germany") & (data["Purchased"]=="No") & (data["Salary"]>=12000) ]

    Country   Age   Salary Purchased      Mobile
2   Germany  30.0  54000.0        No  9847669315
8   Germany  50.0  83000.0        No  9847669321
10  Germany  40.0  15000.0        No  9847669323

### Remove Data From a DataFrame

In [71]:
data.drop("Mobile",axis=1,inplace=True)  # Reomve Column

When we operate on columns we need to specify axis = 1
inplace = True -> Automatically Update the existing DataFrame, By default inplace will be False

In [72]:
data

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain  27.0  48000.0       Yes
2   Germany  30.0  54000.0        No
3     Spain  38.0  61000.0        No
4   Germany  40.0      NaN       Yes
5    France  35.0  58000.0       Yes
6     Spain   NaN  52000.0        No
7    France  48.0  79000.0       Yes
8   Germany  50.0  83000.0        No
9    France  37.0  67000.0       Yes
10  Germany  40.0  15000.0        No

In [73]:
data.drop(["Salary","Purchased"],axis=1) # Deleting multiple columns in one go, Inorder to update the data frame 
                                         # Either we have to assign to to the data variable or have to use inplace=True

    Country   Age
0    France  44.0
1     Spain  27.0
2   Germany  30.0
3     Spain  38.0
4   Germany  40.0
5    France  35.0
6     Spain   NaN
7    France  48.0
8   Germany  50.0
9    France  37.0
10  Germany  40.0

In [74]:
data.drop([2,3],inplace=True) # Removing rows-> Giving row index in list

In [75]:
data

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain  27.0  48000.0       Yes
4   Germany  40.0      NaN       Yes
5    France  35.0  58000.0       Yes
6     Spain   NaN  52000.0        No
7    France  48.0  79000.0       Yes
8   Germany  50.0  83000.0        No
9    France  37.0  67000.0       Yes
10  Germany  40.0  15000.0        No

###### But now the index is not perfect 
###### So reset it in to an order we can use reset_index() , But the old index comes as a column

In [76]:
data.reset_index()

   index  Country   Age   Salary Purchased
0      0   France  44.0  72000.0        No
1      1    Spain  27.0  48000.0       Yes
2      4  Germany  40.0      NaN       Yes
3      5   France  35.0  58000.0       Yes
4      6    Spain   NaN  52000.0        No
5      7   France  48.0  79000.0       Yes
6      8  Germany  50.0  83000.0        No
7      9   France  37.0  67000.0       Yes
8     10  Germany  40.0  15000.0        No

If we don't need that index column any more then we can specify like this - > reset_index(drop=True)

In [77]:
data.reset_index(drop=True,inplace=True)

In [78]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  40.0      NaN       Yes
3   France  35.0  58000.0       Yes
4    Spain   NaN  52000.0        No
5   France  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7   France  37.0  67000.0       Yes
8  Germany  40.0  15000.0        No

### Replacing data with another data

In [79]:
data["Country"].replace("France","Fr",inplace=True) # Replacing one value at a time

In [80]:
data

   Country   Age   Salary Purchased
0       Fr  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  40.0      NaN       Yes
3       Fr  35.0  58000.0       Yes
4    Spain   NaN  52000.0        No
5       Fr  48.0  79000.0       Yes
6  Germany  50.0  83000.0        No
7       Fr  37.0  67000.0       Yes
8  Germany  40.0  15000.0        No

In [81]:
data["Country"].replace({
    "Germany" : "GM",
    "Spain" : "SP"       
},inplace=True)                       # Replacing multiple values at a time

In [82]:
data

  Country   Age   Salary Purchased
0      Fr  44.0  72000.0        No
1      SP  27.0  48000.0       Yes
2      GM  40.0      NaN       Yes
3      Fr  35.0  58000.0       Yes
4      SP   NaN  52000.0        No
5      Fr  48.0  79000.0       Yes
6      GM  50.0  83000.0        No
7      Fr  37.0  67000.0       Yes
8      GM  40.0  15000.0        No

##### Changing Specific Values (Known as setting)

In [83]:
data.iloc[1,1] = 28

In [84]:
data

  Country   Age   Salary Purchased
0      Fr  44.0  72000.0        No
1      SP  28.0  48000.0       Yes
2      GM  40.0      NaN       Yes
3      Fr  35.0  58000.0       Yes
4      SP   NaN  52000.0        No
5      Fr  48.0  79000.0       Yes
6      GM  50.0  83000.0        No
7      Fr  37.0  67000.0       Yes
8      GM  40.0  15000.0        No

### sorting

In [85]:
data.sort_values("Salary",inplace=True)  # Sorting in ascending order 
data

  Country   Age   Salary Purchased
8      GM  40.0  15000.0        No
1      SP  28.0  48000.0       Yes
4      SP   NaN  52000.0        No
3      Fr  35.0  58000.0       Yes
7      Fr  37.0  67000.0       Yes
0      Fr  44.0  72000.0        No
5      Fr  48.0  79000.0       Yes
6      GM  50.0  83000.0        No
2      GM  40.0      NaN       Yes

In [86]:
data.loc[0]

Country           Fr
Age             44.0
Salary       72000.0
Purchased         No
Name: 0, dtype: object

In [87]:
data.sort_values("Salary",inplace=True,ascending=False) # Sorting in Descending order
data

  Country   Age   Salary Purchased
6      GM  50.0  83000.0        No
5      Fr  48.0  79000.0       Yes
0      Fr  44.0  72000.0        No
7      Fr  37.0  67000.0       Yes
3      Fr  35.0  58000.0       Yes
4      SP   NaN  52000.0        No
1      SP  28.0  48000.0       Yes
8      GM  40.0  15000.0        No
2      GM  40.0      NaN       Yes

In [88]:
data.iloc[0:5] # Getting top 5 salary

  Country   Age   Salary Purchased
6      GM  50.0  83000.0        No
5      Fr  48.0  79000.0       Yes
0      Fr  44.0  72000.0        No
7      Fr  37.0  67000.0       Yes
3      Fr  35.0  58000.0       Yes

In [89]:
data.iloc[-5:] # Bottom 5 Salaries

  Country   Age   Salary Purchased
3      Fr  35.0  58000.0       Yes
4      SP   NaN  52000.0        No
1      SP  28.0  48000.0       Yes
8      GM  40.0  15000.0        No
2      GM  40.0      NaN       Yes

##### head() and tail()

In [90]:
data.head(5) # Gives the top 5 rows

  Country   Age   Salary Purchased
6      GM  50.0  83000.0        No
5      Fr  48.0  79000.0       Yes
0      Fr  44.0  72000.0        No
7      Fr  37.0  67000.0       Yes
3      Fr  35.0  58000.0       Yes

In [91]:
data.tail(5) # Gives the bottom 5 rows

  Country   Age   Salary Purchased
3      Fr  35.0  58000.0       Yes
4      SP   NaN  52000.0        No
1      SP  28.0  48000.0       Yes
8      GM  40.0  15000.0        No
2      GM  40.0      NaN       Yes

In [92]:
data.sort_values(by="Age",ascending=False).head(5) # Deatils of top 5 ages

  Country   Age   Salary Purchased
6      GM  50.0  83000.0        No
5      Fr  48.0  79000.0       Yes
0      Fr  44.0  72000.0        No
8      GM  40.0  15000.0        No
2      GM  40.0      NaN       Yes

In [93]:
data.sort_values(by=["Salary","Age"],ascending=False).head(5) # Sort based on salary and age
#By chance if the salary is same then it looks for age

  Country   Age   Salary Purchased
6      GM  50.0  83000.0        No
5      Fr  48.0  79000.0       Yes
0      Fr  44.0  72000.0        No
7      Fr  37.0  67000.0       Yes
3      Fr  35.0  58000.0       Yes

###  Apply Function

In [94]:
data["Age"].apply(lambda x : x+1)  # X will be the age and will be added one to the age

6    51.0
5    49.0
0    45.0
7    38.0
3    36.0
4     NaN
1    29.0
8    41.0
2    41.0
Name: Age, dtype: float64

In [95]:
# Or we can define a funcion

In [96]:
def add(x):
    return x+1

data["Age"].apply(add)

6    51.0
5    49.0
0    45.0
7    38.0
3    36.0
4     NaN
1    29.0
8    41.0
2    41.0
Name: Age, dtype: float64

### describe()

In [97]:
data.describe() #Gives all the statistical data

             Age        Salary
count   8.000000      8.000000
mean   40.250000  59250.000000
std     7.146428  21763.337454
min    28.000000  15000.000000
25%    36.500000  51000.000000
50%    40.000000  62500.000000
75%    45.000000  73750.000000
max    50.000000  83000.000000